## Generated SDC file "CPC2.sdc"

## Copyright (C) 1991-2014 Altera Corporation. All rights reserved.
## Your use of Altera Corporation's design tools, logic functions 
## and other software and tools, and its AMPP partner logic 
## functions, and any output files from any of the foregoing 
## (including device programming or simulation files), and any 
## associated documentation or information are expressly subject 
## to the terms and conditions of the Altera Program License 
## Subscription Agreement, the Altera Quartus II License Agreement,
## the Altera MegaCore Function License Agreement, or other 
## applicable license agreement, including, without limitation, 
## that your use is for the sole purpose of programming logic 
## devices manufactured by Altera and sold by Altera or its 
## authorized distributors.  Please refer to the applicable 
## agreement for further details.


## VENDOR  "Altera"
## PROGRAM "Quartus II"
## VERSION "Version 14.0.0 Build 200 06/17/2014 SJ Web Edition"

## DATE    "Sun Mar 11 22:05:40 2018"

##
## DEVICE  "5CEBA2F17C8"
##


#**************************************************************
# Time Information
#**************************************************************

set_time_format -unit ns -decimal_places 3



#**************************************************************
# Create Clock
#**************************************************************

create_clock -name {altera_reserved_tck} -period 33.333 -waveform { 0.000 16.666 } [get_ports {altera_reserved_tck}]
create_clock -name {CLK_50} -period 20.000 -waveform { 0.000 10.000 } [get_ports { CLK_50 }]
create_clock -name {CLK2_50} -period 20.000 -waveform { 0.000 10.000 } [get_ports {CLK2_50}]
create_clock -name {CLK_12} -period 83.333 -waveform { 0.000 41.666 } [get_ports {CLK_12}]
create_clock -name {cpc_core:core|YM2149:sounddev|addr[4]} -period 250.000 -waveform { 0.000 125.000 } [get_registers {cpc_core:core|YM2149:sounddev|addr[4]}]
create_clock -name {cpc_core:core|ppi_fake:ppi8255|c_o[6]} -period 250.000 -waveform { 0.000 125.000 } [get_registers {cpc_core:core|ppi_fake:ppi8255|c_o[6]}]
create_clock -name {cpc_core:core|tv80s:cpu|iorq_n} -period 250.000 -waveform { 0.000 125.000 } [get_registers {cpc_core:core|tv80s:cpu|iorq_n}]


#**************************************************************
# Create Generated Clock
#**************************************************************

create_generated_clock -name {audio_clock:audio_clk|audio_clock_0002:audio_clock_inst|altera_pll:altera_pll_i|general[0].gpll~FRACTIONAL_PLL_O_VCOPH0} -source [get_pins {audio_clk|audio_clock_inst|altera_pll_i|general[0].gpll~FRACTIONAL_PLL|refclkin}] -duty_cycle 50.000 -multiply_by 519 -divide_by 64 -master_clock {CLK2_50} [get_pins {audio_clk|audio_clock_inst|altera_pll_i|general[0].gpll~FRACTIONAL_PLL|vcoph[0]}] 
create_generated_clock -name {audio_clock:audio_clk|audio_clock_0002:audio_clock_inst|altera_pll:altera_pll_i|outclk_wire[0]} -source [get_pins {audio_clk|audio_clock_inst|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|vco0ph[0]}] -duty_cycle 50.000 -multiply_by 1 -divide_by 132 -master_clock {audio_clock:audio_clk|audio_clock_0002:audio_clock_inst|altera_pll:altera_pll_i|general[0].gpll~FRACTIONAL_PLL_O_VCOPH0} [get_pins {audio_clk|audio_clock_inst|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|divclk}] 
create_generated_clock -name {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|general[0].gpll~FRACTIONAL_PLL_O_VCOPH0} -source [get_pins {master_clk|master_clock_inst|altera_pll_i|general[0].gpll~FRACTIONAL_PLL|refclkin}] -duty_cycle 50.000 -multiply_by 48 -divide_by 5 -master_clock {CLK_50} [get_pins {master_clk|master_clock_inst|altera_pll_i|general[0].gpll~FRACTIONAL_PLL|vcoph[0]}] 
create_generated_clock -name {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[0]} -source [get_pins {master_clk|master_clock_inst|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|vco0ph[0]}] -duty_cycle 50.000 -multiply_by 1 -divide_by 3 -master_clock {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|general[0].gpll~FRACTIONAL_PLL_O_VCOPH0} [get_pins {master_clk|master_clock_inst|altera_pll_i|general[0].gpll~PLL_OUTPUT_COUNTER|divclk}] 
create_generated_clock -name {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[3]} -source [get_pins {master_clk|master_clock_inst|altera_pll_i|general[3].gpll~PLL_OUTPUT_COUNTER|vco0ph[0]}] -duty_cycle 50.000 -multiply_by 1 -divide_by 12 -master_clock {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|general[0].gpll~FRACTIONAL_PLL_O_VCOPH0} [get_pins {master_clk|master_clock_inst|altera_pll_i|general[3].gpll~PLL_OUTPUT_COUNTER|divclk}] 
create_generated_clock -name {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[4]} -source [get_pins {master_clk|master_clock_inst|altera_pll_i|general[4].gpll~PLL_OUTPUT_COUNTER|vco0ph[0]}] -duty_cycle 50.000 -multiply_by 1 -divide_by 30 -master_clock {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|general[0].gpll~FRACTIONAL_PLL_O_VCOPH0} [get_pins {master_clk|master_clock_inst|altera_pll_i|general[4].gpll~PLL_OUTPUT_COUNTER|divclk}] 
create_generated_clock -name {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[2]} -source [get_pins {master_clk|master_clock_inst|altera_pll_i|general[2].gpll~PLL_OUTPUT_COUNTER|vco0ph[0]}] -duty_cycle 50.000 -multiply_by 1 -divide_by 10 -master_clock {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|general[0].gpll~FRACTIONAL_PLL_O_VCOPH0} [get_pins {master_clk|master_clock_inst|altera_pll_i|general[2].gpll~PLL_OUTPUT_COUNTER|divclk}] 
create_generated_clock -name {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[5]} -source [get_pins {master_clk|master_clock_inst|altera_pll_i|general[5].gpll~PLL_OUTPUT_COUNTER|vco0ph[0]}] -duty_cycle 50.000 -multiply_by 1 -divide_by 120 -master_clock {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|general[0].gpll~FRACTIONAL_PLL_O_VCOPH0} [get_pins {master_clk|master_clock_inst|altera_pll_i|general[5].gpll~PLL_OUTPUT_COUNTER|divclk}] 
create_generated_clock -name {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[6]} -source [get_pins {master_clk|master_clock_inst|altera_pll_i|general[6].gpll~PLL_OUTPUT_COUNTER|vco0ph[0]}] -duty_cycle 50.000 -multiply_by 1 -divide_by 480 -master_clock {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|general[0].gpll~FRACTIONAL_PLL_O_VCOPH0} [get_pins {master_clk|master_clock_inst|altera_pll_i|general[6].gpll~PLL_OUTPUT_COUNTER|divclk}] 


#**************************************************************
# Set Clock Latency
#**************************************************************



#**************************************************************
# Set Clock Uncertainty
#**************************************************************

set_clock_uncertainty -rise_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[2]}] -rise_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[2]}] -setup 0.120  
set_clock_uncertainty -rise_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[2]}] -rise_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[2]}] -hold 0.060  
set_clock_uncertainty -rise_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[2]}] -fall_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[2]}] -setup 0.120  
set_clock_uncertainty -rise_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[2]}] -fall_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[2]}] -hold 0.060  
set_clock_uncertainty -rise_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[2]}] -rise_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[4]}] -setup 0.120  
set_clock_uncertainty -rise_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[2]}] -rise_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[4]}] -hold 0.060  
set_clock_uncertainty -rise_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[2]}] -fall_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[4]}] -setup 0.120  
set_clock_uncertainty -rise_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[2]}] -fall_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[4]}] -hold 0.060  
set_clock_uncertainty -rise_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[2]}] -rise_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[3]}] -setup 0.120  
set_clock_uncertainty -rise_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[2]}] -rise_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[3]}] -hold 0.060  
set_clock_uncertainty -rise_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[2]}] -fall_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[3]}] -setup 0.120  
set_clock_uncertainty -rise_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[2]}] -fall_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[3]}] -hold 0.060  
set_clock_uncertainty -rise_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[2]}] -rise_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[0]}] -setup 0.120  
set_clock_uncertainty -rise_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[2]}] -rise_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[0]}] -hold 0.060  
set_clock_uncertainty -rise_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[2]}] -fall_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[0]}] -setup 0.120  
set_clock_uncertainty -rise_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[2]}] -fall_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[0]}] -hold 0.060  
set_clock_uncertainty -rise_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[2]}] -rise_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|general[0].gpll~FRACTIONAL_PLL_O_VCOPH0}] -setup 0.120  
set_clock_uncertainty -rise_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[2]}] -rise_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|general[0].gpll~FRACTIONAL_PLL_O_VCOPH0}] -hold 0.060  
set_clock_uncertainty -rise_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[2]}] -fall_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|general[0].gpll~FRACTIONAL_PLL_O_VCOPH0}] -setup 0.120  
set_clock_uncertainty -rise_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[2]}] -fall_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|general[0].gpll~FRACTIONAL_PLL_O_VCOPH0}] -hold 0.060  
set_clock_uncertainty -rise_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[2]}] -rise_to [get_clocks {cpc_core:core|tv80s:cpu|iorq_n}]  0.210  
set_clock_uncertainty -rise_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[2]}] -fall_to [get_clocks {cpc_core:core|tv80s:cpu|iorq_n}]  0.210  
set_clock_uncertainty -rise_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[2]}] -rise_to [get_clocks {cpc_core:core|ppi_fake:ppi8255|c_o[6]}]  0.210  
set_clock_uncertainty -rise_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[2]}] -fall_to [get_clocks {cpc_core:core|ppi_fake:ppi8255|c_o[6]}]  0.210  
set_clock_uncertainty -rise_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[2]}] -rise_to [get_clocks {cpc_core:core|YM2149:sounddev|addr[4]}]  0.270  
set_clock_uncertainty -rise_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[2]}] -fall_to [get_clocks {cpc_core:core|YM2149:sounddev|addr[4]}]  0.270  
set_clock_uncertainty -rise_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[2]}] -rise_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[5]}] -setup 0.120  
set_clock_uncertainty -rise_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[2]}] -rise_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[5]}] -hold 0.060  
set_clock_uncertainty -rise_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[2]}] -fall_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[5]}] -setup 0.120  
set_clock_uncertainty -rise_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[2]}] -fall_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[5]}] -hold 0.060  
set_clock_uncertainty -rise_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[2]}] -rise_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[6]}] -setup 0.120  
set_clock_uncertainty -rise_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[2]}] -rise_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[6]}] -hold 0.060  
set_clock_uncertainty -rise_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[2]}] -fall_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[6]}] -setup 0.120  
set_clock_uncertainty -rise_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[2]}] -fall_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[6]}] -hold 0.060  
set_clock_uncertainty -fall_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[2]}] -rise_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[2]}] -setup 0.120  
set_clock_uncertainty -fall_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[2]}] -rise_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[2]}] -hold 0.060  
set_clock_uncertainty -fall_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[2]}] -fall_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[2]}] -setup 0.120  
set_clock_uncertainty -fall_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[2]}] -fall_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[2]}] -hold 0.060  
set_clock_uncertainty -fall_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[2]}] -rise_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[4]}] -setup 0.120  
set_clock_uncertainty -fall_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[2]}] -rise_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[4]}] -hold 0.060  
set_clock_uncertainty -fall_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[2]}] -fall_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[4]}] -setup 0.120  
set_clock_uncertainty -fall_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[2]}] -fall_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[4]}] -hold 0.060  
set_clock_uncertainty -fall_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[2]}] -rise_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[3]}] -setup 0.120  
set_clock_uncertainty -fall_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[2]}] -rise_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[3]}] -hold 0.060  
set_clock_uncertainty -fall_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[2]}] -fall_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[3]}] -setup 0.120  
set_clock_uncertainty -fall_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[2]}] -fall_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[3]}] -hold 0.060  
set_clock_uncertainty -fall_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[2]}] -rise_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[0]}] -setup 0.120  
set_clock_uncertainty -fall_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[2]}] -rise_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[0]}] -hold 0.060  
set_clock_uncertainty -fall_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[2]}] -fall_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[0]}] -setup 0.120  
set_clock_uncertainty -fall_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[2]}] -fall_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[0]}] -hold 0.060  
set_clock_uncertainty -fall_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[2]}] -rise_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|general[0].gpll~FRACTIONAL_PLL_O_VCOPH0}] -setup 0.120  
set_clock_uncertainty -fall_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[2]}] -rise_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|general[0].gpll~FRACTIONAL_PLL_O_VCOPH0}] -hold 0.060  
set_clock_uncertainty -fall_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[2]}] -fall_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|general[0].gpll~FRACTIONAL_PLL_O_VCOPH0}] -setup 0.120  
set_clock_uncertainty -fall_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[2]}] -fall_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|general[0].gpll~FRACTIONAL_PLL_O_VCOPH0}] -hold 0.060  
set_clock_uncertainty -fall_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[2]}] -rise_to [get_clocks {cpc_core:core|tv80s:cpu|iorq_n}]  0.210  
set_clock_uncertainty -fall_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[2]}] -fall_to [get_clocks {cpc_core:core|tv80s:cpu|iorq_n}]  0.210  
set_clock_uncertainty -fall_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[2]}] -rise_to [get_clocks {cpc_core:core|ppi_fake:ppi8255|c_o[6]}]  0.210  
set_clock_uncertainty -fall_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[2]}] -fall_to [get_clocks {cpc_core:core|ppi_fake:ppi8255|c_o[6]}]  0.210  
set_clock_uncertainty -fall_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[2]}] -rise_to [get_clocks {cpc_core:core|YM2149:sounddev|addr[4]}]  0.270  
set_clock_uncertainty -fall_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[2]}] -fall_to [get_clocks {cpc_core:core|YM2149:sounddev|addr[4]}]  0.270  
set_clock_uncertainty -fall_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[2]}] -rise_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[5]}] -setup 0.120  
set_clock_uncertainty -fall_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[2]}] -rise_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[5]}] -hold 0.060  
set_clock_uncertainty -fall_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[2]}] -fall_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[5]}] -setup 0.120  
set_clock_uncertainty -fall_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[2]}] -fall_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[5]}] -hold 0.060  
set_clock_uncertainty -fall_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[2]}] -rise_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[6]}] -setup 0.120  
set_clock_uncertainty -fall_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[2]}] -rise_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[6]}] -hold 0.060  
set_clock_uncertainty -fall_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[2]}] -fall_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[6]}] -setup 0.120  
set_clock_uncertainty -fall_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[2]}] -fall_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[6]}] -hold 0.060  
set_clock_uncertainty -rise_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[4]}] -rise_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[2]}] -setup 0.120  
set_clock_uncertainty -rise_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[4]}] -rise_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[2]}] -hold 0.060  
set_clock_uncertainty -rise_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[4]}] -fall_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[2]}] -setup 0.120  
set_clock_uncertainty -rise_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[4]}] -fall_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[2]}] -hold 0.060  
set_clock_uncertainty -rise_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[4]}] -rise_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[4]}] -setup 0.120  
set_clock_uncertainty -rise_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[4]}] -rise_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[4]}] -hold 0.060  
set_clock_uncertainty -rise_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[4]}] -fall_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[4]}] -setup 0.120  
set_clock_uncertainty -rise_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[4]}] -fall_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[4]}] -hold 0.060  
set_clock_uncertainty -rise_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[4]}] -rise_to [get_clocks {cpc_core:core|ppi_fake:ppi8255|c_o[6]}]  0.210  
set_clock_uncertainty -rise_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[4]}] -fall_to [get_clocks {cpc_core:core|ppi_fake:ppi8255|c_o[6]}]  0.210  
set_clock_uncertainty -rise_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[4]}] -rise_to [get_clocks {cpc_core:core|YM2149:sounddev|addr[4]}]  0.270  
set_clock_uncertainty -rise_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[4]}] -fall_to [get_clocks {cpc_core:core|YM2149:sounddev|addr[4]}]  0.270  
set_clock_uncertainty -rise_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[4]}] -rise_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[5]}] -setup 0.120  
set_clock_uncertainty -rise_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[4]}] -rise_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[5]}] -hold 0.060  
set_clock_uncertainty -rise_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[4]}] -fall_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[5]}] -setup 0.120  
set_clock_uncertainty -rise_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[4]}] -fall_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[5]}] -hold 0.060  
set_clock_uncertainty -rise_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[4]}] -rise_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[6]}] -setup 0.120  
set_clock_uncertainty -rise_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[4]}] -rise_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[6]}] -hold 0.060  
set_clock_uncertainty -rise_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[4]}] -fall_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[6]}] -setup 0.120  
set_clock_uncertainty -rise_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[4]}] -fall_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[6]}] -hold 0.060  
set_clock_uncertainty -fall_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[4]}] -rise_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[2]}] -setup 0.120  
set_clock_uncertainty -fall_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[4]}] -rise_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[2]}] -hold 0.060  
set_clock_uncertainty -fall_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[4]}] -fall_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[2]}] -setup 0.120  
set_clock_uncertainty -fall_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[4]}] -fall_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[2]}] -hold 0.060  
set_clock_uncertainty -fall_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[4]}] -rise_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[4]}] -setup 0.120  
set_clock_uncertainty -fall_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[4]}] -rise_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[4]}] -hold 0.060  
set_clock_uncertainty -fall_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[4]}] -fall_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[4]}] -setup 0.120  
set_clock_uncertainty -fall_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[4]}] -fall_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[4]}] -hold 0.060  
set_clock_uncertainty -fall_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[4]}] -rise_to [get_clocks {cpc_core:core|ppi_fake:ppi8255|c_o[6]}]  0.210  
set_clock_uncertainty -fall_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[4]}] -fall_to [get_clocks {cpc_core:core|ppi_fake:ppi8255|c_o[6]}]  0.210  
set_clock_uncertainty -fall_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[4]}] -rise_to [get_clocks {cpc_core:core|YM2149:sounddev|addr[4]}]  0.270  
set_clock_uncertainty -fall_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[4]}] -fall_to [get_clocks {cpc_core:core|YM2149:sounddev|addr[4]}]  0.270  
set_clock_uncertainty -fall_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[4]}] -rise_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[5]}] -setup 0.120  
set_clock_uncertainty -fall_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[4]}] -rise_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[5]}] -hold 0.060  
set_clock_uncertainty -fall_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[4]}] -fall_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[5]}] -setup 0.120  
set_clock_uncertainty -fall_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[4]}] -fall_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[5]}] -hold 0.060  
set_clock_uncertainty -fall_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[4]}] -rise_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[6]}] -setup 0.120  
set_clock_uncertainty -fall_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[4]}] -rise_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[6]}] -hold 0.060  
set_clock_uncertainty -fall_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[4]}] -fall_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[6]}] -setup 0.120  
set_clock_uncertainty -fall_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[4]}] -fall_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[6]}] -hold 0.060  
set_clock_uncertainty -rise_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[3]}] -rise_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[2]}] -setup 0.120  
set_clock_uncertainty -rise_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[3]}] -rise_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[2]}] -hold 0.060  
set_clock_uncertainty -rise_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[3]}] -fall_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[2]}] -setup 0.120  
set_clock_uncertainty -rise_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[3]}] -fall_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[2]}] -hold 0.060  
set_clock_uncertainty -rise_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[3]}] -rise_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[3]}] -setup 0.120  
set_clock_uncertainty -rise_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[3]}] -rise_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[3]}] -hold 0.060  
set_clock_uncertainty -rise_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[3]}] -fall_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[3]}] -setup 0.120  
set_clock_uncertainty -rise_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[3]}] -fall_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[3]}] -hold 0.060  
set_clock_uncertainty -rise_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[3]}] -rise_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[0]}] -setup 0.120  
set_clock_uncertainty -rise_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[3]}] -rise_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[0]}] -hold 0.060  
set_clock_uncertainty -rise_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[3]}] -fall_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[0]}] -setup 0.120  
set_clock_uncertainty -rise_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[3]}] -fall_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[0]}] -hold 0.060  
set_clock_uncertainty -fall_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[3]}] -rise_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[2]}] -setup 0.120  
set_clock_uncertainty -fall_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[3]}] -rise_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[2]}] -hold 0.060  
set_clock_uncertainty -fall_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[3]}] -fall_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[2]}] -setup 0.120  
set_clock_uncertainty -fall_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[3]}] -fall_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[2]}] -hold 0.060  
set_clock_uncertainty -fall_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[3]}] -rise_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[3]}] -setup 0.120  
set_clock_uncertainty -fall_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[3]}] -rise_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[3]}] -hold 0.060  
set_clock_uncertainty -fall_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[3]}] -fall_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[3]}] -setup 0.120  
set_clock_uncertainty -fall_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[3]}] -fall_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[3]}] -hold 0.060  
set_clock_uncertainty -fall_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[3]}] -rise_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[0]}] -setup 0.120  
set_clock_uncertainty -fall_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[3]}] -rise_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[0]}] -hold 0.060  
set_clock_uncertainty -fall_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[3]}] -fall_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[0]}] -setup 0.120  
set_clock_uncertainty -fall_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[3]}] -fall_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[0]}] -hold 0.060  
set_clock_uncertainty -rise_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[0]}] -rise_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[2]}] -setup 0.120  
set_clock_uncertainty -rise_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[0]}] -rise_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[2]}] -hold 0.060  
set_clock_uncertainty -rise_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[0]}] -fall_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[2]}] -setup 0.120  
set_clock_uncertainty -rise_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[0]}] -fall_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[2]}] -hold 0.060  
set_clock_uncertainty -rise_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[0]}] -rise_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[0]}] -setup 0.120  
set_clock_uncertainty -rise_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[0]}] -rise_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[0]}] -hold 0.060  
set_clock_uncertainty -rise_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[0]}] -fall_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[0]}] -setup 0.120  
set_clock_uncertainty -rise_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[0]}] -fall_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[0]}] -hold 0.060  
set_clock_uncertainty -rise_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[0]}] -rise_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|general[0].gpll~FRACTIONAL_PLL_O_VCOPH0}] -setup 0.120  
set_clock_uncertainty -rise_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[0]}] -rise_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|general[0].gpll~FRACTIONAL_PLL_O_VCOPH0}] -hold 0.060  
set_clock_uncertainty -rise_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[0]}] -fall_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|general[0].gpll~FRACTIONAL_PLL_O_VCOPH0}] -setup 0.120  
set_clock_uncertainty -rise_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[0]}] -fall_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|general[0].gpll~FRACTIONAL_PLL_O_VCOPH0}] -hold 0.060  
set_clock_uncertainty -fall_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[0]}] -rise_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[2]}] -setup 0.120  
set_clock_uncertainty -fall_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[0]}] -rise_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[2]}] -hold 0.060  
set_clock_uncertainty -fall_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[0]}] -fall_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[2]}] -setup 0.120  
set_clock_uncertainty -fall_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[0]}] -fall_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[2]}] -hold 0.060  
set_clock_uncertainty -fall_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[0]}] -rise_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[0]}] -setup 0.120  
set_clock_uncertainty -fall_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[0]}] -rise_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[0]}] -hold 0.060  
set_clock_uncertainty -fall_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[0]}] -fall_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[0]}] -setup 0.120  
set_clock_uncertainty -fall_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[0]}] -fall_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[0]}] -hold 0.060  
set_clock_uncertainty -fall_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[0]}] -rise_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|general[0].gpll~FRACTIONAL_PLL_O_VCOPH0}] -setup 0.120  
set_clock_uncertainty -fall_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[0]}] -rise_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|general[0].gpll~FRACTIONAL_PLL_O_VCOPH0}] -hold 0.060  
set_clock_uncertainty -fall_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[0]}] -fall_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|general[0].gpll~FRACTIONAL_PLL_O_VCOPH0}] -setup 0.120  
set_clock_uncertainty -fall_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[0]}] -fall_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|general[0].gpll~FRACTIONAL_PLL_O_VCOPH0}] -hold 0.060  
set_clock_uncertainty -rise_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|general[0].gpll~FRACTIONAL_PLL_O_VCOPH0}] -rise_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[2]}] -setup 0.120  
set_clock_uncertainty -rise_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|general[0].gpll~FRACTIONAL_PLL_O_VCOPH0}] -rise_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[2]}] -hold 0.060  
set_clock_uncertainty -rise_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|general[0].gpll~FRACTIONAL_PLL_O_VCOPH0}] -fall_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[2]}] -setup 0.120  
set_clock_uncertainty -rise_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|general[0].gpll~FRACTIONAL_PLL_O_VCOPH0}] -fall_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[2]}] -hold 0.060  
set_clock_uncertainty -rise_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|general[0].gpll~FRACTIONAL_PLL_O_VCOPH0}] -rise_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[0]}] -setup 0.120  
set_clock_uncertainty -rise_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|general[0].gpll~FRACTIONAL_PLL_O_VCOPH0}] -rise_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[0]}] -hold 0.060  
set_clock_uncertainty -rise_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|general[0].gpll~FRACTIONAL_PLL_O_VCOPH0}] -fall_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[0]}] -setup 0.120  
set_clock_uncertainty -rise_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|general[0].gpll~FRACTIONAL_PLL_O_VCOPH0}] -fall_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[0]}] -hold 0.060  
set_clock_uncertainty -rise_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|general[0].gpll~FRACTIONAL_PLL_O_VCOPH0}] -rise_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|general[0].gpll~FRACTIONAL_PLL_O_VCOPH0}] -setup 0.120  
set_clock_uncertainty -rise_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|general[0].gpll~FRACTIONAL_PLL_O_VCOPH0}] -rise_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|general[0].gpll~FRACTIONAL_PLL_O_VCOPH0}] -hold 0.060  
set_clock_uncertainty -rise_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|general[0].gpll~FRACTIONAL_PLL_O_VCOPH0}] -fall_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|general[0].gpll~FRACTIONAL_PLL_O_VCOPH0}] -setup 0.120  
set_clock_uncertainty -rise_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|general[0].gpll~FRACTIONAL_PLL_O_VCOPH0}] -fall_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|general[0].gpll~FRACTIONAL_PLL_O_VCOPH0}] -hold 0.060  
set_clock_uncertainty -fall_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|general[0].gpll~FRACTIONAL_PLL_O_VCOPH0}] -rise_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[2]}] -setup 0.120  
set_clock_uncertainty -fall_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|general[0].gpll~FRACTIONAL_PLL_O_VCOPH0}] -rise_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[2]}] -hold 0.060  
set_clock_uncertainty -fall_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|general[0].gpll~FRACTIONAL_PLL_O_VCOPH0}] -fall_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[2]}] -setup 0.120  
set_clock_uncertainty -fall_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|general[0].gpll~FRACTIONAL_PLL_O_VCOPH0}] -fall_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[2]}] -hold 0.060  
set_clock_uncertainty -fall_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|general[0].gpll~FRACTIONAL_PLL_O_VCOPH0}] -rise_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[0]}] -setup 0.120  
set_clock_uncertainty -fall_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|general[0].gpll~FRACTIONAL_PLL_O_VCOPH0}] -rise_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[0]}] -hold 0.060  
set_clock_uncertainty -fall_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|general[0].gpll~FRACTIONAL_PLL_O_VCOPH0}] -fall_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[0]}] -setup 0.120  
set_clock_uncertainty -fall_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|general[0].gpll~FRACTIONAL_PLL_O_VCOPH0}] -fall_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[0]}] -hold 0.060  
set_clock_uncertainty -fall_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|general[0].gpll~FRACTIONAL_PLL_O_VCOPH0}] -rise_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|general[0].gpll~FRACTIONAL_PLL_O_VCOPH0}] -setup 0.120  
set_clock_uncertainty -fall_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|general[0].gpll~FRACTIONAL_PLL_O_VCOPH0}] -rise_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|general[0].gpll~FRACTIONAL_PLL_O_VCOPH0}] -hold 0.060  
set_clock_uncertainty -fall_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|general[0].gpll~FRACTIONAL_PLL_O_VCOPH0}] -fall_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|general[0].gpll~FRACTIONAL_PLL_O_VCOPH0}] -setup 0.120  
set_clock_uncertainty -fall_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|general[0].gpll~FRACTIONAL_PLL_O_VCOPH0}] -fall_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|general[0].gpll~FRACTIONAL_PLL_O_VCOPH0}] -hold 0.060  
set_clock_uncertainty -rise_from [get_clocks {audio_clock:audio_clk|audio_clock_0002:audio_clock_inst|altera_pll:altera_pll_i|outclk_wire[0]}] -rise_to [get_clocks {audio_clock:audio_clk|audio_clock_0002:audio_clock_inst|altera_pll:altera_pll_i|outclk_wire[0]}] -setup 0.130  
set_clock_uncertainty -rise_from [get_clocks {audio_clock:audio_clk|audio_clock_0002:audio_clock_inst|altera_pll:altera_pll_i|outclk_wire[0]}] -rise_to [get_clocks {audio_clock:audio_clk|audio_clock_0002:audio_clock_inst|altera_pll:altera_pll_i|outclk_wire[0]}] -hold 0.060  
set_clock_uncertainty -rise_from [get_clocks {audio_clock:audio_clk|audio_clock_0002:audio_clock_inst|altera_pll:altera_pll_i|outclk_wire[0]}] -fall_to [get_clocks {audio_clock:audio_clk|audio_clock_0002:audio_clock_inst|altera_pll:altera_pll_i|outclk_wire[0]}] -setup 0.130  
set_clock_uncertainty -rise_from [get_clocks {audio_clock:audio_clk|audio_clock_0002:audio_clock_inst|altera_pll:altera_pll_i|outclk_wire[0]}] -fall_to [get_clocks {audio_clock:audio_clk|audio_clock_0002:audio_clock_inst|altera_pll:altera_pll_i|outclk_wire[0]}] -hold 0.060  
set_clock_uncertainty -fall_from [get_clocks {audio_clock:audio_clk|audio_clock_0002:audio_clock_inst|altera_pll:altera_pll_i|outclk_wire[0]}] -rise_to [get_clocks {audio_clock:audio_clk|audio_clock_0002:audio_clock_inst|altera_pll:altera_pll_i|outclk_wire[0]}] -setup 0.130  
set_clock_uncertainty -fall_from [get_clocks {audio_clock:audio_clk|audio_clock_0002:audio_clock_inst|altera_pll:altera_pll_i|outclk_wire[0]}] -rise_to [get_clocks {audio_clock:audio_clk|audio_clock_0002:audio_clock_inst|altera_pll:altera_pll_i|outclk_wire[0]}] -hold 0.060  
set_clock_uncertainty -fall_from [get_clocks {audio_clock:audio_clk|audio_clock_0002:audio_clock_inst|altera_pll:altera_pll_i|outclk_wire[0]}] -fall_to [get_clocks {audio_clock:audio_clk|audio_clock_0002:audio_clock_inst|altera_pll:altera_pll_i|outclk_wire[0]}] -setup 0.130  
set_clock_uncertainty -fall_from [get_clocks {audio_clock:audio_clk|audio_clock_0002:audio_clock_inst|altera_pll:altera_pll_i|outclk_wire[0]}] -fall_to [get_clocks {audio_clock:audio_clk|audio_clock_0002:audio_clock_inst|altera_pll:altera_pll_i|outclk_wire[0]}] -hold 0.060  
set_clock_uncertainty -rise_from [get_clocks {cpc_core:core|tv80s:cpu|iorq_n}] -rise_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[4]}]  0.210  
set_clock_uncertainty -rise_from [get_clocks {cpc_core:core|tv80s:cpu|iorq_n}] -fall_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[4]}]  0.210  
set_clock_uncertainty -rise_from [get_clocks {cpc_core:core|tv80s:cpu|iorq_n}] -rise_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[3]}]  0.210  
set_clock_uncertainty -rise_from [get_clocks {cpc_core:core|tv80s:cpu|iorq_n}] -fall_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[3]}]  0.210  
set_clock_uncertainty -rise_from [get_clocks {cpc_core:core|tv80s:cpu|iorq_n}] -rise_to [get_clocks {cpc_core:core|tv80s:cpu|iorq_n}]  0.270  
set_clock_uncertainty -rise_from [get_clocks {cpc_core:core|tv80s:cpu|iorq_n}] -fall_to [get_clocks {cpc_core:core|tv80s:cpu|iorq_n}]  0.270  
set_clock_uncertainty -rise_from [get_clocks {cpc_core:core|tv80s:cpu|iorq_n}] -rise_to [get_clocks {cpc_core:core|ppi_fake:ppi8255|c_o[6]}]  0.270  
set_clock_uncertainty -rise_from [get_clocks {cpc_core:core|tv80s:cpu|iorq_n}] -fall_to [get_clocks {cpc_core:core|ppi_fake:ppi8255|c_o[6]}]  0.270  
set_clock_uncertainty -rise_from [get_clocks {cpc_core:core|tv80s:cpu|iorq_n}] -rise_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[5]}]  0.210  
set_clock_uncertainty -rise_from [get_clocks {cpc_core:core|tv80s:cpu|iorq_n}] -fall_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[5]}]  0.210  
set_clock_uncertainty -rise_from [get_clocks {cpc_core:core|tv80s:cpu|iorq_n}] -rise_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[6]}]  0.210  
set_clock_uncertainty -rise_from [get_clocks {cpc_core:core|tv80s:cpu|iorq_n}] -fall_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[6]}]  0.210  
set_clock_uncertainty -fall_from [get_clocks {cpc_core:core|tv80s:cpu|iorq_n}] -rise_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[4]}]  0.210  
set_clock_uncertainty -fall_from [get_clocks {cpc_core:core|tv80s:cpu|iorq_n}] -fall_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[4]}]  0.210  
set_clock_uncertainty -fall_from [get_clocks {cpc_core:core|tv80s:cpu|iorq_n}] -rise_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[3]}]  0.210  
set_clock_uncertainty -fall_from [get_clocks {cpc_core:core|tv80s:cpu|iorq_n}] -fall_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[3]}]  0.210  
set_clock_uncertainty -fall_from [get_clocks {cpc_core:core|tv80s:cpu|iorq_n}] -rise_to [get_clocks {cpc_core:core|tv80s:cpu|iorq_n}]  0.270  
set_clock_uncertainty -fall_from [get_clocks {cpc_core:core|tv80s:cpu|iorq_n}] -fall_to [get_clocks {cpc_core:core|tv80s:cpu|iorq_n}]  0.270  
set_clock_uncertainty -fall_from [get_clocks {cpc_core:core|tv80s:cpu|iorq_n}] -rise_to [get_clocks {cpc_core:core|ppi_fake:ppi8255|c_o[6]}]  0.270  
set_clock_uncertainty -fall_from [get_clocks {cpc_core:core|tv80s:cpu|iorq_n}] -fall_to [get_clocks {cpc_core:core|ppi_fake:ppi8255|c_o[6]}]  0.270  
set_clock_uncertainty -fall_from [get_clocks {cpc_core:core|tv80s:cpu|iorq_n}] -rise_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[5]}]  0.210  
set_clock_uncertainty -fall_from [get_clocks {cpc_core:core|tv80s:cpu|iorq_n}] -fall_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[5]}]  0.210  
set_clock_uncertainty -fall_from [get_clocks {cpc_core:core|tv80s:cpu|iorq_n}] -rise_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[6]}]  0.210  
set_clock_uncertainty -fall_from [get_clocks {cpc_core:core|tv80s:cpu|iorq_n}] -fall_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[6]}]  0.210  
set_clock_uncertainty -rise_from [get_clocks {cpc_core:core|ppi_fake:ppi8255|c_o[6]}] -rise_to [get_clocks {cpc_core:core|ppi_fake:ppi8255|c_o[6]}]  0.270  
set_clock_uncertainty -rise_from [get_clocks {cpc_core:core|ppi_fake:ppi8255|c_o[6]}] -fall_to [get_clocks {cpc_core:core|ppi_fake:ppi8255|c_o[6]}]  0.270  
set_clock_uncertainty -rise_from [get_clocks {cpc_core:core|ppi_fake:ppi8255|c_o[6]}] -rise_to [get_clocks {cpc_core:core|YM2149:sounddev|addr[4]}]  0.320  
set_clock_uncertainty -rise_from [get_clocks {cpc_core:core|ppi_fake:ppi8255|c_o[6]}] -fall_to [get_clocks {cpc_core:core|YM2149:sounddev|addr[4]}]  0.320  
set_clock_uncertainty -rise_from [get_clocks {cpc_core:core|ppi_fake:ppi8255|c_o[6]}] -rise_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[6]}]  0.210  
set_clock_uncertainty -rise_from [get_clocks {cpc_core:core|ppi_fake:ppi8255|c_o[6]}] -fall_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[6]}]  0.210  
set_clock_uncertainty -fall_from [get_clocks {cpc_core:core|ppi_fake:ppi8255|c_o[6]}] -rise_to [get_clocks {cpc_core:core|ppi_fake:ppi8255|c_o[6]}]  0.270  
set_clock_uncertainty -fall_from [get_clocks {cpc_core:core|ppi_fake:ppi8255|c_o[6]}] -fall_to [get_clocks {cpc_core:core|ppi_fake:ppi8255|c_o[6]}]  0.270  
set_clock_uncertainty -fall_from [get_clocks {cpc_core:core|ppi_fake:ppi8255|c_o[6]}] -rise_to [get_clocks {cpc_core:core|YM2149:sounddev|addr[4]}]  0.320  
set_clock_uncertainty -fall_from [get_clocks {cpc_core:core|ppi_fake:ppi8255|c_o[6]}] -fall_to [get_clocks {cpc_core:core|YM2149:sounddev|addr[4]}]  0.320  
set_clock_uncertainty -fall_from [get_clocks {cpc_core:core|ppi_fake:ppi8255|c_o[6]}] -rise_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[6]}]  0.210  
set_clock_uncertainty -fall_from [get_clocks {cpc_core:core|ppi_fake:ppi8255|c_o[6]}] -fall_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[6]}]  0.210  
set_clock_uncertainty -rise_from [get_clocks {cpc_core:core|YM2149:sounddev|addr[4]}] -rise_to [get_clocks {cpc_core:core|ppi_fake:ppi8255|c_o[6]}]  0.320  
set_clock_uncertainty -rise_from [get_clocks {cpc_core:core|YM2149:sounddev|addr[4]}] -fall_to [get_clocks {cpc_core:core|ppi_fake:ppi8255|c_o[6]}]  0.320  
set_clock_uncertainty -rise_from [get_clocks {cpc_core:core|YM2149:sounddev|addr[4]}] -rise_to [get_clocks {cpc_core:core|YM2149:sounddev|addr[4]}]  0.380  
set_clock_uncertainty -rise_from [get_clocks {cpc_core:core|YM2149:sounddev|addr[4]}] -fall_to [get_clocks {cpc_core:core|YM2149:sounddev|addr[4]}]  0.380  
set_clock_uncertainty -rise_from [get_clocks {cpc_core:core|YM2149:sounddev|addr[4]}] -rise_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[6]}]  0.270  
set_clock_uncertainty -rise_from [get_clocks {cpc_core:core|YM2149:sounddev|addr[4]}] -fall_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[6]}]  0.270  
set_clock_uncertainty -fall_from [get_clocks {cpc_core:core|YM2149:sounddev|addr[4]}] -rise_to [get_clocks {cpc_core:core|ppi_fake:ppi8255|c_o[6]}]  0.320  
set_clock_uncertainty -fall_from [get_clocks {cpc_core:core|YM2149:sounddev|addr[4]}] -fall_to [get_clocks {cpc_core:core|ppi_fake:ppi8255|c_o[6]}]  0.320  
set_clock_uncertainty -fall_from [get_clocks {cpc_core:core|YM2149:sounddev|addr[4]}] -rise_to [get_clocks {cpc_core:core|YM2149:sounddev|addr[4]}]  0.380  
set_clock_uncertainty -fall_from [get_clocks {cpc_core:core|YM2149:sounddev|addr[4]}] -fall_to [get_clocks {cpc_core:core|YM2149:sounddev|addr[4]}]  0.380  
set_clock_uncertainty -fall_from [get_clocks {cpc_core:core|YM2149:sounddev|addr[4]}] -rise_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[6]}]  0.270  
set_clock_uncertainty -fall_from [get_clocks {cpc_core:core|YM2149:sounddev|addr[4]}] -fall_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[6]}]  0.270  
set_clock_uncertainty -rise_from [get_clocks {CLK_50}] -rise_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[2]}]  0.130  
set_clock_uncertainty -rise_from [get_clocks {CLK_50}] -fall_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[2]}]  0.130  
set_clock_uncertainty -rise_from [get_clocks {CLK_50}] -rise_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[4]}]  0.130  
set_clock_uncertainty -rise_from [get_clocks {CLK_50}] -fall_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[4]}]  0.130  
set_clock_uncertainty -rise_from [get_clocks {CLK_50}] -rise_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[0]}]  0.130  
set_clock_uncertainty -rise_from [get_clocks {CLK_50}] -fall_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[0]}]  0.130  
set_clock_uncertainty -rise_from [get_clocks {CLK_50}] -rise_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|general[0].gpll~FRACTIONAL_PLL_O_VCOPH0}]  0.130  
set_clock_uncertainty -rise_from [get_clocks {CLK_50}] -fall_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|general[0].gpll~FRACTIONAL_PLL_O_VCOPH0}]  0.130  
set_clock_uncertainty -rise_from [get_clocks {CLK_50}] -rise_to [get_clocks {cpc_core:core|tv80s:cpu|iorq_n}]  0.180  
set_clock_uncertainty -rise_from [get_clocks {CLK_50}] -fall_to [get_clocks {cpc_core:core|tv80s:cpu|iorq_n}]  0.180  
set_clock_uncertainty -rise_from [get_clocks {CLK_50}] -rise_to [get_clocks {cpc_core:core|ppi_fake:ppi8255|c_o[6]}]  0.180  
set_clock_uncertainty -rise_from [get_clocks {CLK_50}] -fall_to [get_clocks {cpc_core:core|ppi_fake:ppi8255|c_o[6]}]  0.180  
set_clock_uncertainty -rise_from [get_clocks {CLK_50}] -rise_to [get_clocks {cpc_core:core|YM2149:sounddev|addr[4]}]  0.240  
set_clock_uncertainty -rise_from [get_clocks {CLK_50}] -fall_to [get_clocks {cpc_core:core|YM2149:sounddev|addr[4]}]  0.240  
set_clock_uncertainty -rise_from [get_clocks {CLK_50}] -rise_to [get_clocks {CLK_50}] -setup 0.100  
set_clock_uncertainty -rise_from [get_clocks {CLK_50}] -rise_to [get_clocks {CLK_50}] -hold 0.060  
set_clock_uncertainty -rise_from [get_clocks {CLK_50}] -fall_to [get_clocks {CLK_50}] -setup 0.100  
set_clock_uncertainty -rise_from [get_clocks {CLK_50}] -fall_to [get_clocks {CLK_50}] -hold 0.060  
set_clock_uncertainty -rise_from [get_clocks {CLK_50}] -rise_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[5]}]  0.130  
set_clock_uncertainty -rise_from [get_clocks {CLK_50}] -fall_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[5]}]  0.130  
set_clock_uncertainty -rise_from [get_clocks {CLK_50}] -rise_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[6]}]  0.130  
set_clock_uncertainty -rise_from [get_clocks {CLK_50}] -fall_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[6]}]  0.130  
set_clock_uncertainty -fall_from [get_clocks {CLK_50}] -rise_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[2]}]  0.130  
set_clock_uncertainty -fall_from [get_clocks {CLK_50}] -fall_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[2]}]  0.130  
set_clock_uncertainty -fall_from [get_clocks {CLK_50}] -rise_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[4]}]  0.130  
set_clock_uncertainty -fall_from [get_clocks {CLK_50}] -fall_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[4]}]  0.130  
set_clock_uncertainty -fall_from [get_clocks {CLK_50}] -rise_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[0]}]  0.130  
set_clock_uncertainty -fall_from [get_clocks {CLK_50}] -fall_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[0]}]  0.130  
set_clock_uncertainty -fall_from [get_clocks {CLK_50}] -rise_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|general[0].gpll~FRACTIONAL_PLL_O_VCOPH0}]  0.130  
set_clock_uncertainty -fall_from [get_clocks {CLK_50}] -fall_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|general[0].gpll~FRACTIONAL_PLL_O_VCOPH0}]  0.130  
set_clock_uncertainty -fall_from [get_clocks {CLK_50}] -rise_to [get_clocks {cpc_core:core|tv80s:cpu|iorq_n}]  0.180  
set_clock_uncertainty -fall_from [get_clocks {CLK_50}] -fall_to [get_clocks {cpc_core:core|tv80s:cpu|iorq_n}]  0.180  
set_clock_uncertainty -fall_from [get_clocks {CLK_50}] -rise_to [get_clocks {cpc_core:core|ppi_fake:ppi8255|c_o[6]}]  0.180  
set_clock_uncertainty -fall_from [get_clocks {CLK_50}] -fall_to [get_clocks {cpc_core:core|ppi_fake:ppi8255|c_o[6]}]  0.180  
set_clock_uncertainty -fall_from [get_clocks {CLK_50}] -rise_to [get_clocks {cpc_core:core|YM2149:sounddev|addr[4]}]  0.240  
set_clock_uncertainty -fall_from [get_clocks {CLK_50}] -fall_to [get_clocks {cpc_core:core|YM2149:sounddev|addr[4]}]  0.240  
set_clock_uncertainty -fall_from [get_clocks {CLK_50}] -rise_to [get_clocks {CLK_50}] -setup 0.100  
set_clock_uncertainty -fall_from [get_clocks {CLK_50}] -rise_to [get_clocks {CLK_50}] -hold 0.060  
set_clock_uncertainty -fall_from [get_clocks {CLK_50}] -fall_to [get_clocks {CLK_50}] -setup 0.100  
set_clock_uncertainty -fall_from [get_clocks {CLK_50}] -fall_to [get_clocks {CLK_50}] -hold 0.060  
set_clock_uncertainty -fall_from [get_clocks {CLK_50}] -rise_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[5]}]  0.130  
set_clock_uncertainty -fall_from [get_clocks {CLK_50}] -fall_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[5]}]  0.130  
set_clock_uncertainty -fall_from [get_clocks {CLK_50}] -rise_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[6]}]  0.130  
set_clock_uncertainty -fall_from [get_clocks {CLK_50}] -fall_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[6]}]  0.130  
set_clock_uncertainty -rise_from [get_clocks {altera_reserved_tck}] -rise_to [get_clocks {altera_reserved_tck}] -setup 0.280  
set_clock_uncertainty -rise_from [get_clocks {altera_reserved_tck}] -rise_to [get_clocks {altera_reserved_tck}] -hold 0.270  
set_clock_uncertainty -rise_from [get_clocks {altera_reserved_tck}] -fall_to [get_clocks {altera_reserved_tck}] -setup 0.280  
set_clock_uncertainty -rise_from [get_clocks {altera_reserved_tck}] -fall_to [get_clocks {altera_reserved_tck}] -hold 0.270  
set_clock_uncertainty -fall_from [get_clocks {altera_reserved_tck}] -rise_to [get_clocks {altera_reserved_tck}] -setup 0.280  
set_clock_uncertainty -fall_from [get_clocks {altera_reserved_tck}] -rise_to [get_clocks {altera_reserved_tck}] -hold 0.270  
set_clock_uncertainty -fall_from [get_clocks {altera_reserved_tck}] -fall_to [get_clocks {altera_reserved_tck}] -setup 0.280  
set_clock_uncertainty -fall_from [get_clocks {altera_reserved_tck}] -fall_to [get_clocks {altera_reserved_tck}] -hold 0.270  
set_clock_uncertainty -rise_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[5]}] -rise_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[2]}] -setup 0.120  
set_clock_uncertainty -rise_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[5]}] -rise_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[2]}] -hold 0.060  
set_clock_uncertainty -rise_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[5]}] -fall_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[2]}] -setup 0.120  
set_clock_uncertainty -rise_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[5]}] -fall_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[2]}] -hold 0.060  
set_clock_uncertainty -rise_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[5]}] -rise_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[4]}] -setup 0.120  
set_clock_uncertainty -rise_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[5]}] -rise_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[4]}] -hold 0.060  
set_clock_uncertainty -rise_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[5]}] -fall_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[4]}] -setup 0.120  
set_clock_uncertainty -rise_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[5]}] -fall_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[4]}] -hold 0.060  
set_clock_uncertainty -rise_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[5]}] -rise_to [get_clocks {cpc_core:core|tv80s:cpu|iorq_n}]  0.210  
set_clock_uncertainty -rise_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[5]}] -fall_to [get_clocks {cpc_core:core|tv80s:cpu|iorq_n}]  0.210  
set_clock_uncertainty -rise_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[5]}] -rise_to [get_clocks {cpc_core:core|ppi_fake:ppi8255|c_o[6]}]  0.210  
set_clock_uncertainty -rise_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[5]}] -fall_to [get_clocks {cpc_core:core|ppi_fake:ppi8255|c_o[6]}]  0.210  
set_clock_uncertainty -rise_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[5]}] -rise_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[5]}] -setup 0.120  
set_clock_uncertainty -rise_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[5]}] -rise_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[5]}] -hold 0.060  
set_clock_uncertainty -rise_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[5]}] -fall_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[5]}] -setup 0.120  
set_clock_uncertainty -rise_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[5]}] -fall_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[5]}] -hold 0.060  
set_clock_uncertainty -fall_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[5]}] -rise_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[2]}] -setup 0.120  
set_clock_uncertainty -fall_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[5]}] -rise_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[2]}] -hold 0.060  
set_clock_uncertainty -fall_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[5]}] -fall_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[2]}] -setup 0.120  
set_clock_uncertainty -fall_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[5]}] -fall_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[2]}] -hold 0.060  
set_clock_uncertainty -fall_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[5]}] -rise_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[4]}] -setup 0.120  
set_clock_uncertainty -fall_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[5]}] -rise_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[4]}] -hold 0.060  
set_clock_uncertainty -fall_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[5]}] -fall_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[4]}] -setup 0.120  
set_clock_uncertainty -fall_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[5]}] -fall_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[4]}] -hold 0.060  
set_clock_uncertainty -fall_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[5]}] -rise_to [get_clocks {cpc_core:core|tv80s:cpu|iorq_n}]  0.210  
set_clock_uncertainty -fall_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[5]}] -fall_to [get_clocks {cpc_core:core|tv80s:cpu|iorq_n}]  0.210  
set_clock_uncertainty -fall_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[5]}] -rise_to [get_clocks {cpc_core:core|ppi_fake:ppi8255|c_o[6]}]  0.210  
set_clock_uncertainty -fall_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[5]}] -fall_to [get_clocks {cpc_core:core|ppi_fake:ppi8255|c_o[6]}]  0.210  
set_clock_uncertainty -fall_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[5]}] -rise_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[5]}] -setup 0.120  
set_clock_uncertainty -fall_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[5]}] -rise_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[5]}] -hold 0.060  
set_clock_uncertainty -fall_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[5]}] -fall_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[5]}] -setup 0.120  
set_clock_uncertainty -fall_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[5]}] -fall_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[5]}] -hold 0.060  
set_clock_uncertainty -rise_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[6]}] -rise_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[4]}] -setup 0.120  
set_clock_uncertainty -rise_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[6]}] -rise_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[4]}] -hold 0.060  
set_clock_uncertainty -rise_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[6]}] -fall_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[4]}] -setup 0.120  
set_clock_uncertainty -rise_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[6]}] -fall_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[4]}] -hold 0.060  
set_clock_uncertainty -rise_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[6]}] -rise_to [get_clocks {audio_clock:audio_clk|audio_clock_0002:audio_clock_inst|altera_pll:altera_pll_i|outclk_wire[0]}]  0.160  
set_clock_uncertainty -rise_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[6]}] -fall_to [get_clocks {audio_clock:audio_clk|audio_clock_0002:audio_clock_inst|altera_pll:altera_pll_i|outclk_wire[0]}]  0.160  
set_clock_uncertainty -rise_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[6]}] -rise_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[6]}] -setup 0.120  
set_clock_uncertainty -rise_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[6]}] -rise_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[6]}] -hold 0.060  
set_clock_uncertainty -rise_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[6]}] -fall_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[6]}] -setup 0.120  
set_clock_uncertainty -rise_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[6]}] -fall_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[6]}] -hold 0.060  
set_clock_uncertainty -fall_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[6]}] -rise_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[4]}] -setup 0.120  
set_clock_uncertainty -fall_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[6]}] -rise_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[4]}] -hold 0.060  
set_clock_uncertainty -fall_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[6]}] -fall_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[4]}] -setup 0.120  
set_clock_uncertainty -fall_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[6]}] -fall_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[4]}] -hold 0.060  
set_clock_uncertainty -fall_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[6]}] -rise_to [get_clocks {audio_clock:audio_clk|audio_clock_0002:audio_clock_inst|altera_pll:altera_pll_i|outclk_wire[0]}]  0.160  
set_clock_uncertainty -fall_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[6]}] -fall_to [get_clocks {audio_clock:audio_clk|audio_clock_0002:audio_clock_inst|altera_pll:altera_pll_i|outclk_wire[0]}]  0.160  
set_clock_uncertainty -fall_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[6]}] -rise_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[6]}] -setup 0.120  
set_clock_uncertainty -fall_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[6]}] -rise_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[6]}] -hold 0.060  
set_clock_uncertainty -fall_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[6]}] -fall_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[6]}] -setup 0.120  
set_clock_uncertainty -fall_from [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[6]}] -fall_to [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[6]}] -hold 0.060  


#**************************************************************
# Set Input Delay
#**************************************************************

set_input_delay -add_delay  -clock [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[2]}]  0.000 [get_ports {DATA5}]
set_input_delay -add_delay  -clock [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[2]}]  0.000 [get_ports {I2C_SCL}]
set_input_delay -add_delay  -clock [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[2]}]  0.000 [get_ports {I2C_SDA}]
set_input_delay -add_delay  -clock [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[0]}]  0.000 [get_ports {sdram_Dq[0]}]
set_input_delay -add_delay  -clock [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[0]}]  0.000 [get_ports {sdram_Dq[1]}]
set_input_delay -add_delay  -clock [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[0]}]  0.000 [get_ports {sdram_Dq[2]}]
set_input_delay -add_delay  -clock [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[0]}]  0.000 [get_ports {sdram_Dq[3]}]
set_input_delay -add_delay  -clock [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[0]}]  0.000 [get_ports {sdram_Dq[4]}]
set_input_delay -add_delay  -clock [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[0]}]  0.000 [get_ports {sdram_Dq[5]}]
set_input_delay -add_delay  -clock [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[0]}]  0.000 [get_ports {sdram_Dq[6]}]
set_input_delay -add_delay  -clock [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[0]}]  0.000 [get_ports {sdram_Dq[7]}]
set_input_delay -add_delay  -clock [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[0]}]  0.000 [get_ports {sdram_Dq[8]}]
set_input_delay -add_delay  -clock [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[0]}]  0.000 [get_ports {sdram_Dq[9]}]
set_input_delay -add_delay  -clock [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[0]}]  0.000 [get_ports {sdram_Dq[10]}]
set_input_delay -add_delay  -clock [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[0]}]  0.000 [get_ports {sdram_Dq[11]}]
set_input_delay -add_delay  -clock [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[0]}]  0.000 [get_ports {sdram_Dq[12]}]
set_input_delay -add_delay  -clock [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[0]}]  0.000 [get_ports {sdram_Dq[13]}]
set_input_delay -add_delay  -clock [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[0]}]  0.000 [get_ports {sdram_Dq[14]}]
set_input_delay -add_delay  -clock [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[0]}]  0.000 [get_ports {sdram_Dq[15]}]
set_input_delay -add_delay  -clock [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[2]}]  0.000 [get_ports {uart_rx_i}]
set_input_delay -add_delay  -clock [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[2]}]  0.000 [get_ports {usb_vm}]
set_input_delay -add_delay  -clock [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[2]}]  0.000 [get_ports {usb_vp}]


#**************************************************************
# Set Output Delay
#**************************************************************

set_output_delay -add_delay  -clock [get_clocks {audio_clock:audio_clk|audio_clock_0002:audio_clock_inst|altera_pll:altera_pll_i|outclk_wire[0]}]  0.000 [get_ports {ASCLK}]
set_output_delay -add_delay  -clock [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[3]}]  0.000 [get_ports {B[0]}]
set_output_delay -add_delay  -clock [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[3]}]  0.000 [get_ports {B[1]}]
set_output_delay -add_delay  -clock [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[3]}]  0.000 [get_ports {B[2]}]
set_output_delay -add_delay  -clock [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[3]}]  0.000 [get_ports {B[3]}]
set_output_delay -add_delay  -clock [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[3]}]  0.000 [get_ports {B[4]}]
set_output_delay -add_delay  -clock [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[3]}]  0.000 [get_ports {B[5]}]
set_output_delay -add_delay  -clock [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[3]}]  0.000 [get_ports {B[6]}]
set_output_delay -add_delay  -clock [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[3]}]  0.000 [get_ports {B[7]}]
set_output_delay -add_delay  -clock [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[3]}]  0.000 [get_ports {G[0]}]
set_output_delay -add_delay  -clock [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[3]}]  0.000 [get_ports {G[1]}]
set_output_delay -add_delay  -clock [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[3]}]  0.000 [get_ports {G[2]}]
set_output_delay -add_delay  -clock [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[3]}]  0.000 [get_ports {G[3]}]
set_output_delay -add_delay  -clock [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[3]}]  0.000 [get_ports {G[4]}]
set_output_delay -add_delay  -clock [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[3]}]  0.000 [get_ports {G[5]}]
set_output_delay -add_delay  -clock [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[3]}]  0.000 [get_ports {G[6]}]
set_output_delay -add_delay  -clock [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[3]}]  0.000 [get_ports {G[7]}]
set_output_delay -add_delay  -clock [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[3]}]  0.000 [get_ports {HSYNC}]
set_output_delay -add_delay  -clock [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[2]}]  0.000 [get_ports {I2C_SCL}]
set_output_delay -add_delay  -clock [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[2]}]  0.000 [get_ports {I2C_SDA}]
set_output_delay -add_delay  -clock [get_clocks {audio_clock:audio_clk|audio_clock_0002:audio_clock_inst|altera_pll:altera_pll_i|outclk_wire[0]}]  0.000 [get_ports {I2S[0]}]
set_output_delay -add_delay  -clock [get_clocks {audio_clock:audio_clk|audio_clock_0002:audio_clock_inst|altera_pll:altera_pll_i|outclk_wire[0]}]  0.000 [get_ports {I2S[1]}]
set_output_delay -add_delay  -clock [get_clocks {audio_clock:audio_clk|audio_clock_0002:audio_clock_inst|altera_pll:altera_pll_i|outclk_wire[0]}]  0.000 [get_ports {I2S[2]}]
set_output_delay -add_delay  -clock [get_clocks {audio_clock:audio_clk|audio_clock_0002:audio_clock_inst|altera_pll:altera_pll_i|outclk_wire[0]}]  0.000 [get_ports {I2S[3]}]
set_output_delay -add_delay  -clock [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[2]}]  0.000 [get_ports {LED}]
set_output_delay -add_delay  -clock [get_clocks {audio_clock:audio_clk|audio_clock_0002:audio_clock_inst|altera_pll:altera_pll_i|outclk_wire[0]}]  0.000 [get_ports {LRCLK}]
set_output_delay -add_delay  -clock [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[3]}]  0.000 [get_ports {R[0]}]
set_output_delay -add_delay  -clock [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[3]}]  0.000 [get_ports {R[1]}]
set_output_delay -add_delay  -clock [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[3]}]  0.000 [get_ports {R[2]}]
set_output_delay -add_delay  -clock [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[3]}]  0.000 [get_ports {R[3]}]
set_output_delay -add_delay  -clock [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[3]}]  0.000 [get_ports {R[4]}]
set_output_delay -add_delay  -clock [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[3]}]  0.000 [get_ports {R[5]}]
set_output_delay -add_delay  -clock [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[3]}]  0.000 [get_ports {R[6]}]
set_output_delay -add_delay  -clock [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[3]}]  0.000 [get_ports {R[7]}]
set_output_delay -add_delay  -clock [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[3]}]  0.000 [get_ports {VCLK}]
set_output_delay -add_delay  -clock [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[3]}]  0.000 [get_ports {VDE}]
set_output_delay -add_delay  -clock [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[3]}]  0.000 [get_ports {VSYNC}]
set_output_delay -add_delay  -clock [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[0]}]  0.000 [get_ports {sdram_Addr[0]}]
set_output_delay -add_delay  -clock [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[0]}]  0.000 [get_ports {sdram_Addr[1]}]
set_output_delay -add_delay  -clock [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[0]}]  0.000 [get_ports {sdram_Addr[2]}]
set_output_delay -add_delay  -clock [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[0]}]  0.000 [get_ports {sdram_Addr[3]}]
set_output_delay -add_delay  -clock [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[0]}]  0.000 [get_ports {sdram_Addr[4]}]
set_output_delay -add_delay  -clock [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[0]}]  0.000 [get_ports {sdram_Addr[5]}]
set_output_delay -add_delay  -clock [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[0]}]  0.000 [get_ports {sdram_Addr[6]}]
set_output_delay -add_delay  -clock [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[0]}]  0.000 [get_ports {sdram_Addr[7]}]
set_output_delay -add_delay  -clock [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[0]}]  0.000 [get_ports {sdram_Addr[8]}]
set_output_delay -add_delay  -clock [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[0]}]  0.000 [get_ports {sdram_Addr[9]}]
set_output_delay -add_delay  -clock [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[0]}]  0.000 [get_ports {sdram_Addr[10]}]
set_output_delay -add_delay  -clock [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[0]}]  0.000 [get_ports {sdram_Addr[11]}]
set_output_delay -add_delay  -clock [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[0]}]  0.000 [get_ports {sdram_Ba[0]}]
set_output_delay -add_delay  -clock [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[0]}]  0.000 [get_ports {sdram_Ba[1]}]
set_output_delay -add_delay  -clock [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[0]}]  0.000 [get_ports {sdram_Cas_n}]
set_output_delay -add_delay  -clock [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[0]}]  0.000 [get_ports {sdram_Cke}]
set_output_delay -add_delay  -clock [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[0]}]  0.000 [get_ports {sdram_Clk}]
set_output_delay -add_delay  -clock [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[0]}]  0.000 [get_ports {sdram_Cs_n}]
set_output_delay -add_delay  -clock [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[0]}]  0.000 [get_ports {sdram_Dq[0]}]
set_output_delay -add_delay  -clock [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[0]}]  0.000 [get_ports {sdram_Dq[1]}]
set_output_delay -add_delay  -clock [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[0]}]  0.000 [get_ports {sdram_Dq[2]}]
set_output_delay -add_delay  -clock [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[0]}]  0.000 [get_ports {sdram_Dq[3]}]
set_output_delay -add_delay  -clock [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[0]}]  0.000 [get_ports {sdram_Dq[4]}]
set_output_delay -add_delay  -clock [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[0]}]  0.000 [get_ports {sdram_Dq[5]}]
set_output_delay -add_delay  -clock [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[0]}]  0.000 [get_ports {sdram_Dq[6]}]
set_output_delay -add_delay  -clock [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[0]}]  0.000 [get_ports {sdram_Dq[7]}]
set_output_delay -add_delay  -clock [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[0]}]  0.000 [get_ports {sdram_Dq[8]}]
set_output_delay -add_delay  -clock [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[0]}]  0.000 [get_ports {sdram_Dq[9]}]
set_output_delay -add_delay  -clock [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[0]}]  0.000 [get_ports {sdram_Dq[10]}]
set_output_delay -add_delay  -clock [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[0]}]  0.000 [get_ports {sdram_Dq[11]}]
set_output_delay -add_delay  -clock [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[0]}]  0.000 [get_ports {sdram_Dq[12]}]
set_output_delay -add_delay  -clock [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[0]}]  0.000 [get_ports {sdram_Dq[13]}]
set_output_delay -add_delay  -clock [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[0]}]  0.000 [get_ports {sdram_Dq[14]}]
set_output_delay -add_delay  -clock [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[0]}]  0.000 [get_ports {sdram_Dq[15]}]
set_output_delay -add_delay  -clock [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[0]}]  0.000 [get_ports {sdram_Dqm[0]}]
set_output_delay -add_delay  -clock [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[0]}]  0.000 [get_ports {sdram_Dqm[1]}]
set_output_delay -add_delay  -clock [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[0]}]  0.000 [get_ports {sdram_Ras_n}]
set_output_delay -add_delay  -clock [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[0]}]  0.000 [get_ports {sdram_We_n}]
set_output_delay -add_delay  -clock [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[2]}]  0.000 [get_ports {uart_tx_o}]
set_output_delay -add_delay  -clock [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[2]}]  0.000 [get_ports {usb_mode}]
set_output_delay -add_delay  -clock [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[2]}]  0.000 [get_ports {usb_oen}]
set_output_delay -add_delay  -clock [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[2]}]  0.000 [get_ports {usb_speed}]
set_output_delay -add_delay  -clock [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[2]}]  0.000 [get_ports {usb_suspend}]
set_output_delay -add_delay  -clock [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[2]}]  0.000 [get_ports {usb_vmo}]
set_output_delay -add_delay  -clock [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[2]}]  0.000 [get_ports {usb_vpo}]


#**************************************************************
# Set Clock Groups
#**************************************************************

set_clock_groups -asynchronous -group [get_clocks {altera_reserved_tck}] 
set_clock_groups -asynchronous -group [get_clocks {altera_reserved_tck}] 
set_clock_groups -asynchronous -group [get_clocks {altera_reserved_tck}] 
set_clock_groups -asynchronous -group [get_clocks {altera_reserved_tck}] 
set_clock_groups -asynchronous -group [get_clocks {altera_reserved_tck}] 
set_clock_groups -asynchronous -group [get_clocks {altera_reserved_tck}] 


#**************************************************************
# Set False Path
#**************************************************************

set_false_path  -from  [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[6]}]  -to  [get_clocks {audio_clock:audio_clk|audio_clock_0002:audio_clock_inst|altera_pll:altera_pll_i|outclk_wire[0]}]
set_false_path  -from  [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[2]}]  -to  [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[3]}]
set_false_path  -from  [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[2]}]  -to  [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[5]}]
set_false_path  -from  [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[3]}]  -to  [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[2]}]
set_false_path  -from  [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[4]}]  -to  [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[2]}]
set_false_path  -from  [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[5]}]  -to  [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[2]}]
set_false_path  -from  [get_clocks {cpc_core:core|YM2149:sounddev|addr[4]}]  -to  [get_clocks {cpc_core:core|ppi_fake:ppi8255|c_o[6]}]
set_false_path  -from  [get_clocks {cpc_core:core|ppi_fake:ppi8255|c_o[6]}]  -to  [get_clocks {cpc_core:core|YM2149:sounddev|addr[4]}]
set_false_path  -from  [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[2]}]  -to  [get_clocks {cpc_core:core|tv80s:cpu|iorq_n}]
set_false_path  -from  [get_clocks {cpc_core:core|YM2149:sounddev|addr[4]}]  -to  [get_clocks {cpc_core:core|YM2149:sounddev|addr[4]}]
set_false_path  -from  [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[4]}]  -to  [get_clocks {cpc_core:core|ppi_fake:ppi8255|c_o[6]}]
set_false_path  -from  [get_clocks {CLK_50}]  -to  [get_clocks {cpc_core:core|tv80s:cpu|iorq_n}]
set_false_path  -from  [get_clocks {cpc_core:core|tv80s:cpu|iorq_n}]  -to  [get_clocks {cpc_core:core|tv80s:cpu|iorq_n}]
set_false_path  -from  [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[5]}]  -to  [get_clocks {cpc_core:core|tv80s:cpu|iorq_n}]
set_false_path  -from  [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[3]}]  -to  [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[0]}]
set_false_path  -from  [get_clocks {CLK_50}]  -to  [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[2]}]
set_false_path  -from  [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|general[0].gpll~FRACTIONAL_PLL_O_VCOPH0}]  -to  [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[2]}]
set_false_path  -from  [get_clocks {cpc_core:core|tv80s:cpu|iorq_n}]  -to  [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[3]}]
set_false_path  -from  [get_clocks {CLK_50}]  -to  [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[4]}]
set_false_path  -from  [get_clocks {cpc_core:core|tv80s:cpu|iorq_n}]  -to  [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[4]}]
set_false_path  -from  [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[2]}]  -to  [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[4]}]
set_false_path  -from  [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[5]}]  -to  [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[4]}]
set_false_path  -from  [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[6]}]  -to  [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[4]}]
set_false_path  -from  [get_clocks {CLK_50}]  -to  [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[5]}]
set_false_path  -from  [get_clocks {cpc_core:core|tv80s:cpu|iorq_n}]  -to  [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[5]}]
set_false_path  -from  [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[4]}]  -to  [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[5]}]
set_false_path  -from  [get_clocks {CLK_50}]  -to  [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[6]}]
set_false_path  -from  [get_clocks {cpc_core:core|ppi_fake:ppi8255|c_o[6]}]  -to  [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[6]}]
set_false_path  -from  [get_clocks {cpc_core:core|tv80s:cpu|iorq_n}]  -to  [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[6]}]
set_false_path  -from  [get_clocks {cpc_core:core|YM2149:sounddev|addr[4]}]  -to  [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[6]}]
set_false_path  -from  [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[2]}]  -to  [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[6]}]
set_false_path  -from  [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[4]}]  -to  [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[6]}]
set_false_path  -from  [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[4]}]  -to  [get_clocks {cpc_core:core|YM2149:sounddev|addr[4]}]
set_false_path  -from  [get_clocks {cpc_core:core|ppi_fake:ppi8255|c_o[6]}]  -to  [get_clocks {cpc_core:core|ppi_fake:ppi8255|c_o[6]}]
set_false_path  -from  [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|general[0].gpll~FRACTIONAL_PLL_O_VCOPH0}]  -to  [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[0]}]
set_false_path  -from  [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[2]}]  -to  [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|general[0].gpll~FRACTIONAL_PLL_O_VCOPH0}]
set_false_path  -from  [get_clocks {CLK_50}]  -to  [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|general[0].gpll~FRACTIONAL_PLL_O_VCOPH0}]
set_false_path  -from  [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[0]}]  -to  [get_clocks {master_clock:master_clk|master_clock_0002:master_clock_inst|altera_pll:altera_pll_i|outclk_wire[0]}]
set_false_path -from [get_keepers {global_reset:global_reset|reset_counter[*]}] 
set_false_path -from [get_keepers {DATA5}] 
set_false_path -from [get_keepers {dma:dma|state.ERROR}] -to [get_keepers {dma:dma|D_o[0]}]
set_false_path -from [get_keepers {dma:dma|state.IDLE}] -to [get_keepers {dma:dma|D_o[1]}]
set_false_path -from [get_keepers {dma:dma|state.IDLE}] -to [get_keepers {dma:dma|D_o[2]}]
set_false_path -from [get_keepers {sdram:ram|ready_o}] -to [get_keepers {dma:dma|D_o[3]}]
set_false_path -from [get_keepers {dma:dma|state.ERROR}] -to [get_keepers {dma:dma|D_o[1]}]


#**************************************************************
# Set Multicycle Path
#**************************************************************



#**************************************************************
# Set Maximum Delay
#**************************************************************



#**************************************************************
# Set Minimum Delay
#**************************************************************



#**************************************************************
# Set Input Transition
#**************************************************************

